package main
/* 猴子粉桃
思路 ：使用循环语句试错最后一个猴子拿到的猴子 x
		海滩上的桃子等于 第五个猴子所得乘以5+1 sum=5*x+1
		海滩上的桃子被4整除 成立 （5x+1）%4==0
		第四个猴子拿到的桃子是 sum/4 & (5x+1)/4
		海滩上的桃子等于 第四个猴子所得乘以5+1  sum=X4*5+1

 */
import (
	"fmt"
)

func main() {
	var X[6] int
	var sum[6] int
	for i:=1;;i++{
		X[5]=i  			// 猴子所得
		sum[5]=X[5]*5+1 	// 第五次分桃之前的桃子总数
		if sum[5]%4==0{
			X[4]=sum[5]/4   //猴子所得
			sum[4]=X[4]*5+1 //第四次分桃之前的桃子总数
			if sum[4]%4==0{
				X[3]=sum[4]/4 // 猴子所得
				sum[3]=X[3]*5+1// 第三次分桃之前的桃子总数
				if sum[3]%4==0{
					X[2]=sum[3]/4//猴子所得
					sum[2]=X[2]*5+1// 第二次分桃之前桃仔数
					if sum[2]%4==0{
						X[1]=sum[2]/4
						sum[1]=X[1]*5+1
						fmt.Println(sum[1],sum[2],sum[3],sum[4],sum[5])
						fmt.Println(X[1],X[2],X[3],X[4],X[5])
						break
					}

				}
			}

		}
	}
}