package main

import "fmt"

func main() {
	/*		行	*	换行
*****		1	5	1
*****		2	5	1
*****		3	5	1
*****
*****
		行		*		换行
*		1		1		1
**		2		2		1
***		3		3		1
****	4		4		1
*****	5		5		1
 */
	for i := 1; i <= 5; i++ {
		for j := 0; j < i; j++ {
			fmt.Print("*")
		}
		fmt.Println()
	}

	for i := 0; i < 5; i++ {
		for j := 0; j < 5; j++ { // 01234
			fmt.Print("*")
		}
		fmt.Println()
	}

	for i := 1; i<=5;i++{//外层循环控制行数
		//1.空格
		/*
		i=1, k:0,1,2,3   k<4
		i=2, k:0,1,2 	 k<3
		i=3, k:0,1		 k<2
		 */
		for k := 0;k<5 -i;k++{
			fmt.Print(" ")
		}
		//2.*
		for j:=0;j<5;j++{
			fmt.Print("*")
		}
		//3.换行
		fmt.Println()

	}

	/*
					行	空格	*	换行
		*****	1	4		5	1
	   *****	2	3		5	1
	  *****		3	2		5	1
	 *****		4	1		5	1
	*****		5	0		5	1

	*****
	****
	***
	**
	*


		*
	   **
	  ***
	 ****
	*****
	 */

}
